num = int(input('Введите число:'))
# ИСПРАВИТЬ: вывод не соответствует требуемому формату (см. комментарий к тесту)
print(f' Следующее за числом {num} число: {num + 1} \n Для числа {num} предыдущее число: {num - 1}')


# Введите число:23
# КОММЕНТАРИЙ: это недостоверный вывод
# Следующее за числом 23 число: 24
# Для числа 23 предыдущее число: 22

# КОММЕНТАРИЙ: ваш вывод выглядит так:
# Введите число:23
#  Следующее за числом 23 число: 24
#  Для числа 23 предыдущее число: 22

# КОММЕНТАРИЙ: в случае, если вы будете генерировать строку не для чтения человеком, а для другой функции/класса/программы — неверный формат может стоить вам неработающего приложения


# ИТОГ: хорошо, немного доработать — 2/3
